dataset_gen/Earlier_Datasets/CE-Gauss_openfoam/Design_Point_0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          128;
        startFace       32512;
        matchTolerance  0.0001;
        neighbourPatch  right;
        transformType   translational;
        separation      (-1 0 0);
    }
    right
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          128;
        startFace       32640;
        matchTolerance  0.0001;
        neighbourPatch  left;
        transformType   translational;
        separation      (1 0 0);
    }
    bottom
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          128;
        startFace       32768;
        matchTolerance  0.0001;
        neighbourPatch  top;
        transformType   translational;
        separation      (0 -1 0);
    }
    top
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          128;
        startFace       32896;
        matchTolerance  0.0001;
        neighbourPatch  bottom;
        transformType   translational;
        separation      (0 1 0);
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          32768;
        startFace       33024;
    }
)

// ************************************************************************* //
