dataset_gen/Earlier_Datasets/CE-Gauss_openfoam/Design_Point_0/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volvectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
16384
(
(0.2034296864668968 0.10341044856565168 0)
(0.20868059350844217 0.053496530058802894 0)
(0.21908818891217838 0.007959709063251372 0)
(0.22736105884283858 -0.03568263966463418 0)
(0.23726904603521298 -0.07804500864942798 0)
(0.2456527675246463 -0.11987901397232609 0)
(0.2545937162226389 -0.1616184085761562 0)
(0.2618623776239551 -0.2039066502406462 0)
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }

    right
    {
        type            cyclic;
    }

    front
    {
        type            cyclic;
    }

    back
    {
        type            cyclic;
    }

}
